### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd
import locale

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
players = purchase_data['SN'].unique()
num_players = players.size
num_purchases = purchase_data["Item Name"].count()
unique_items = purchase_data['Item ID'].unique().size
average_price = round(purchase_data['Price'].mean(), 2)
revenue = round(purchase_data['Price'].sum(), 2)
revenue_str = '${:,.2f}'.format(revenue)

## Player Count

* Display the total number of players

In [4]:
print(num_players)

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
df2 = pd.DataFrame({
        'Number of Unique Items':[unique_items],
        'Average Price':[average_price],
        'Number of Purchases':[num_purchases],
        'Total Revenue':[revenue_str]}
    )
df2
# 183	3.05	780	$2,379.77

   Number of Unique Items  Average Price  Number of Purchases Total Revenue
0                     183           3.05                  780     $2,379.77

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [6]:
player_demographics = purchase_data.loc[:, ["Gender", "SN"]] # "Age"
player_demographics = player_demographics.drop_duplicates()
gender_counts = player_demographics["Gender"].value_counts()
gender_counts_percent = gender_counts*100/num_players

gender_demographics = pd.DataFrame({"Total Count": gender_counts,
                                    "Percentage of Players": gender_counts_percent})
gender_demographics = gender_demographics.round(2)
gender_demographics

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [25]:
gender_players_gb = purchase_data.groupby(['Gender'])

gender_players_gb_count = gender_players_gb.count()['Purchase ID'].rename("Purchase Count")
gender_purchase_tot = gender_players_gb.sum()['Price'].rename("Total Purchase Value")
gender_purchase_ave = round(gender_players_gb.mean()['Price'].rename("Average Purchase Price"),2)
purchase_per_person = round(gender_purchase_tot/gender_counts,2)

# gender_purchase_tot_str =  '${:,.2f}'.format(gender_purchase_tot)


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [43]:
df3 = pd.DataFrame({
        'Purchase Count':gender_players_gb_count,
        'Average Purchase Price':gender_purchase_ave,
        'Total Purchase Value':gender_purchase_tot,
        'Avg Total Purchase per Person':purchase_per_person}
    )


df3["Total Purchase Value"] = df3["Total Purchase Value"].astype(float).map('${:.2f}'.format)
df3["Avg Total Purchase per Person"] = df3["Average Purchase Price"].astype(float).map('${:.2f}'.format)

df3

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,$361.94,$3.20
Male,652,3.02,$1967.64,$3.02
Other / Non-Disclosed,15,3.35,$50.19,$3.35

              Age Percentage Of Players
20 to 24      365                46.79%
15 to 19      138                17.69%
25 to 29      101                12.95%
30 to 34       73                 9.36%
35 to 39       41                 5.26%
less then 10   32                 4.10%
10 to 14       17                 2.18%
40+             6                 0.77%

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [48]:
#bins group
age_bins = [0,10,13,19,24,29,34,39,40]
group_names = ["less then 10", "10 to 14", "15 to 19", "20 to 24", "25 to 29", "30 to 34", "35 to 39", "40+"]

age_range = pd.cut(purchase_data["Age"], age_bins, labels=group_names)
purchase_data["Age Ranges"] = age_range
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20 to 24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20 to 24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20 to 24
4,4,Iskosia90,23,Male,131,Fury,1.44,20 to 24

In [ ]:
age_range_count = age_range.value_counts()
age_range_count_df = age_range_count.to_frame()
age_range_count_df["Percentage Of Players"] = (age_range_count_df["Age"]*100/num_purchases).astype(float).map('{:.2f}%'.format)
age_range_count_df

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [68]:
purchase_data_gb_age = purchase_data.groupby(["Age Ranges"])
age_range_count = purchase_data_gb_age.count()["SN"].rename("Purchase Count")
age_range_count

Age Ranges
less then 10     32
10 to 14         17
15 to 19        138
20 to 24        365
25 to 29        101
30 to 34         73
35 to 39         41
40+               6
Name: Purchase Count, dtype: int64

In [69]:
average_purchase_price = purchase_data_gb_age.mean()["Price"].rename("Average Purchase Price")
average_purchase_price

Age Ranges
less then 10    3.405000
10 to 14        2.590588
15 to 19        3.042029
20 to 24        3.052219
25 to 29        2.900990
30 to 34        2.931507
35 to 39        3.601707
40+             2.785000
Name: Average Purchase Price, dtype: float64

In [70]:
total_purchase_price = purchase_data_gb_age.sum()["Price"].rename("Total Purchase Price")
total_purchase_price

Age Ranges
less then 10     108.96
10 to 14          44.04
15 to 19         419.80
20 to 24        1114.06
25 to 29         293.00
30 to 34         214.00
35 to 39         147.67
40+               16.71
Name: Total Purchase Price, dtype: float64

In [72]:
average_purchase_price_ar = total_purchase_price/age_range_count
average_purchase_price_ar

Age Ranges
less then 10    3.405000
10 to 14        2.590588
15 to 19        3.042029
20 to 24        3.052219
25 to 29        2.900990
30 to 34        2.931507
35 to 39        3.601707
40+             2.785000
dtype: float64

In [73]:
purchasing_analysis = pd.DataFrame({"Purchase Count":age_range_count,
                           "Average Purchase Price":average_purchase_price,
                            "Total Purchase Value":total_purchase_price,
                            "Avg Total Purchase per Person":average_purchase_price_ar
                      })

purchasing_analysis["Average Purchase Price"] = purchasing_analysis["Average Purchase Price"].astype(float).map('${:.2f}'.format)
purchasing_analysis["Total Purchase Value"] = purchasing_analysis["Total Purchase Value"].astype(float).map('${:.2f}'.format)
purchasing_analysis["Avg Total Purchase per Person"] = purchasing_analysis["Avg Total Purchase per Person"].astype(float).map('${:.2f}'.format)

purchasing_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
less then 10,32,$3.40,$108.96,$3.40
10 to 14,17,$2.59,$44.04,$2.59
15 to 19,138,$3.04,$419.80,$3.04
20 to 24,365,$3.05,$1114.06,$3.05
25 to 29,101,$2.90,$293.00,$2.90
30 to 34,73,$2.93,$214.00,$2.93
35 to 39,41,$3.60,$147.67,$3.60
40+,6,$2.79,$16.71,$2.79

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [122]:
purchase_data_gb_sn = purchase_data.groupby(["SN"])

sn_count = purchase_data_gb_sn["Purchase ID"].count()  # sn_count = purchase_data_gb_sn.count()["Purchase ID"].rename("Purchase Count")
sn_average_purchase_price = purchase_data_gb_sn["Price"].mean()
sn_total_purchase_price = purchase_data_gb_sn["Price"].sum()


purchasing_analysis2 = pd.DataFrame({"Purchase Count":sn_count,
                           "Average Purchase Price":sn_average_purchase_price,
                            "Total Purchase Value":sn_total_purchase_price,
                       })

purchasing_analysis_sorted = purchasing_analysis2.sort_values(by=['Total Purchase Value'], ascending=False)

purchasing_analysis_sorted["Average Purchase Price"] = purchasing_analysis_sorted["Average Purchase Price"].astype(float).map('${:.2f}'.format)
purchasing_analysis_sorted["Total Purchase Value"] = purchasing_analysis_sorted["Total Purchase Value"].astype(float).map('${:.2f}'.format)

purchasing_analysis_sorted.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [140]:
# need to do read up on this
player_smallset = purchase_data.loc[:, ["Item ID", "Item Name", "Price"]]


player_smallset_gb = player_smallset.groupby(["Item ID", "Item Name"])
player_smallset_count = purchase_data_gb_sn["Item ID"].count().rename("Count")

# purchasing_analysis2 = pd.DataFrame({player_smallset, "Purchase Count":player_smallset_count                       })

# player_smallset_gb_t = player_smallset_gb.sort_values(by=['Item ID'],  ascending=False)

pop_df = pd.DataFrame({"Item Count":player_smallset_count
                       })

purchasing_analysis_sorted = pop_df.sort_values(['Item Count'], ascending=False)


purchasing_analysis_sorted.head()

             Item Count
SN
Lisosia93             5
Iral74                4
Idastidru52           4
Asur53                3
Inguron55             3

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [135]:
profitable_item = purchase_data.loc[:, ["Item ID", "Item Name", "Price"]]
profitable_item_gb = profitable_item.groupby(["Item ID", "Item Name"]).agg({"Price": ['count','sum']})
profitable_item_gb = profitable_item_gb.sort_values(by = ('Price','count'),  ascending=False)
profitable_item_gb.head()

                                                     Price
                                                     count    sum
Item ID Item Name
178     Oathbreaker, Last Hope of the Breaking Storm    12  50.76
145     Fiery Glass Crusader                             9  41.22
108     Extraction, Quickblade Of Trembling Hands        9  31.77
82      Nirvana                                          9  44.10
19      Pursuit, Cudgel of Necromancy                    8   8.16